; domain
(define (domain waiter)
    (:requirements :typing :negative-preconditions)
    (:types
        location machine client drink - object
    )

    (:predicates
        (robot-at ?loc - location)
        (request ?c - client ?d - drink)
        (produce ?m - machine ?d - drink)
        (located ?m - machine ?loc - location)
        (fetching ?c - client ?d - drink)
        (serving ?c - client ?d - drink)
        (served ?c - client)
        (takes-request)
    )

    (:action take-request
        :parameters (?c - client ?d - drink ?m - machine ?loc - location)
        :precondition 
            (and
                (robot-at bar)
                (request ?c ?d)
                (produce ?m ?d)
                (located ?m ?loc)
                (takes-request)
            )
        :effect 
            (and
                (fetching ?c ?d)
                (not (request ?c ?d))
                (not (takes-request))
            )
    )

    (:action go-to-place
        :parameters ( ?loc_i ?loc_f - location)
        :precondition 
            (and
                (robot-at ?loc_i)
            )
        :effect 
            (and
                (robot-at ?loc_f)
                (not (robot-at ?loc_i))
            )
    )

    (:action get-drink
        :parameters (?c - client ?d - drink ?m - machine ?loc - location)
        :precondition 
            (and
                (fetching ?c ?d)
                (produce ?m ?d)
                (located ?m ?loc)
                (robot-at ?loc)
            )
        :effect 
            (and
                (not (fetching ?c ?d))
                (serving ?c ?d)
            )
    )

    (:action give-drink
        :parameters (?c - client ?d - drink)
        :precondition 
            (and
                (serving ?c ?d)
                (robot-at bar)
            )
        :effect 
            (and
                (served ?c)
                (takes-request)
                (not (serving ?c ?d))
            )
    )
)

; problem
(define (problem prob1)
    (:domain waiter)
    (:objects
        bar kitchen buffet - location
        kettle coffee_maker - machine
        c1 c2 c3 c4 - client
        tea coffee - drink
    )
    (:init
        (robot-at bar)
        (produce kettle tea)
        (produce coffee_maker coffee)
        (located kettle kitchen)
        (located coffee_maker buffet)

        (request c1 tea)
        (request c2 coffee)
        (request c3 coffee)
        (request c4 tea)
        (takes-request)
    )
    (:goal 
        (and
            (served c1)
            (served c2)
            (served c3)
            (served c4)
        )
    )
)

; plan
1. (take-request c1 tea kettle kitchen)
   deleted: (request c1 tea) (takes-request)
   added: (fetching c1 tea)
   goals met: 0 of 4
2. (go-to-place bar kitchen)
   deleted: (robot-at bar)
   added: (robot-at kitchen)
   goals met: 0 of 4
3. (get-drink c1 tea kettle kitchen)
   deleted: (fetching c1 tea)
   added: (serving c1 tea)
   goals met: 0 of 4
4. (go-to-place kitchen bar)
   deleted: (robot-at kitchen)
   added: (robot-at bar)
   goals met: 0 of 4
5. (give-drink c1 tea)
   deleted: (serving c1 tea)
   added: (served c1) (takes-request)
   goals met: 1 of 4
6. (take-request c4 tea kettle kitchen)
   deleted: (request c4 tea) (takes-request)
   added: (fetching c4 tea)
   goals met: 1 of 4
7. (go-to-place bar kitchen)
   deleted: (robot-at bar)
   added: (robot-at kitchen)
   goals met: 1 of 4
8. (get-drink c4 tea kettle kitchen)
   deleted: (fetching c4 tea)
   added: (serving c4 tea)
   goals met: 1 of 4
9. (go-to-place kitchen bar)
   deleted: (robot-at kitchen)
   added: (robot-at bar)
   goals met: 1 of 4
10. (give-drink c4 tea)
   deleted: (serving c4 tea)
   added: (served c4) (takes-request)
   goals met: 2 of 4
11. (take-request c2 coffee coffee_maker buffet)
   deleted: (request c2 coffee) (takes-request)
   added: (fetching c2 coffee)
   goals met: 2 of 4
12. (go-to-place bar buffet)
   deleted: (robot-at bar)
   added: (robot-at buffet)
   goals met: 2 of 4
13. (get-drink c2 coffee coffee_maker buffet)
   deleted: (fetching c2 coffee)
   added: (serving c2 coffee)
   goals met: 2 of 4
14. (go-to-place buffet bar)
   deleted: (robot-at buffet)
   added: (robot-at bar)
   goals met: 2 of 4
15. (give-drink c2 coffee)
   deleted: (serving c2 coffee)
   added: (served c2) (takes-request)
   goals met: 3 of 4
16. (take-request c3 coffee coffee_maker buffet)
   deleted: (request c3 coffee) (takes-request)
   added: (fetching c3 coffee)
   goals met: 3 of 4
17. (go-to-place bar buffet)
   deleted: (robot-at bar)
   added: (robot-at buffet)
   goals met: 3 of 4
18. (get-drink c3 coffee coffee_maker buffet)
   deleted: (fetching c3 coffee)
   added: (serving c3 coffee)
   goals met: 3 of 4
19. (go-to-place buffet bar)
   deleted: (robot-at buffet)
   added: (robot-at bar)
   goals met: 3 of 4
20. (give-drink c3 coffee)
   deleted: (serving c3 coffee)
   added: (served c3) (takes-request)
   goals met: 4 of 4
